K6-Tests/resultados/epica2-volume-phase2-10k.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: epica2-volume.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 3m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 3m0s (gracefulStop: 30s)

time="2026-03-02T17:09:00-03:00" level=info msg="Registrar el volumen actual: SELECT COUNT(*) FROM loans; SELECT COUNT(*) FROM kardex;" source=console

running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m00.9s/3m0s

running (0m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m01.9s/3m0s

running (0m03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m02.9s/3m0s

running (0m04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m03.9s/3m0s

running (0m05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m04.9s/3m0s

running (0m06.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m05.9s/3m0s

running (0m07.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m06.9s/3m0s

running (0m08.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m07.9s/3m0s

running (0m09.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m08.9s/3m0s

running (0m10.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m09.9s/3m0s

running (0m11.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m10.9s/3m0s

running (0m12.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m11.9s/3m0s

running (0m13.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m12.9s/3m0s

running (0m14.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m13.9s/3m0s

running (0m15.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m14.9s/3m0s

running (0m16.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m15.9s/3m0s

running (0m17.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m16.9s/3m0s

running (0m18.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m17.9s/3m0s

running (0m19.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m18.9s/3m0s

running (0m20.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m19.9s/3m0s

running (0m21.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m20.9s/3m0s

running (0m22.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m21.9s/3m0s

running (0m23.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m22.9s/3m0s

running (0m24.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m23.9s/3m0s

running (0m25.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m24.9s/3m0s

running (0m26.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m25.9s/3m0s

running (0m27.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m26.9s/3m0s

running (0m28.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m27.9s/3m0s

running (0m29.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m28.9s/3m0s

running (0m30.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m29.9s/3m0s

running (0m31.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m30.9s/3m0s

running (0m32.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m31.9s/3m0s

running (0m33.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m32.9s/3m0s

running (0m34.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m33.9s/3m0s

running (0m35.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m34.9s/3m0s

running (0m36.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m35.9s/3m0s

running (0m37.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  0m36.9s/3m0s

running (0m38.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  0m37.9s/3m0s

running (0m39.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m38.9s/3m0s

running (0m40.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m39.9s/3m0s

running (0m41.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  0m40.9s/3m0s

running (0m42.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  0m41.9s/3m0s

running (0m43.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  0m42.9s/3m0s

running (0m44.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  0m43.9s/3m0s

running (0m45.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  0m44.9s/3m0s

running (0m46.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  0m45.9s/3m0s

running (0m47.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  0m46.9s/3m0s

running (0m48.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m47.9s/3m0s

running (0m49.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m48.9s/3m0s

running (0m50.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  0m49.9s/3m0s

running (0m51.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  0m50.9s/3m0s

running (0m52.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  0m51.9s/3m0s

running (0m53.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  0m52.9s/3m0s

running (0m54.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  0m53.9s/3m0s

running (0m55.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  0m54.9s/3m0s

running (0m56.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  0m55.9s/3m0s

running (0m57.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m56.9s/3m0s

running (0m58.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m57.9s/3m0s

running (0m59.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  0m58.9s/3m0s

running (1m00.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  0m59.9s/3m0s

running (1m01.0s), 10/10 VUs, 115 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m00.9s/3m0s

running (1m02.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m01.9s/3m0s

running (1m03.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m02.9s/3m0s

running (1m04.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m03.9s/3m0s

running (1m05.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m04.9s/3m0s

running (1m06.0s), 10/10 VUs, 125 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m05.9s/3m0s

running (1m07.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m06.9s/3m0s

running (1m08.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m07.9s/3m0s

running (1m09.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m08.9s/3m0s

running (1m10.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m09.9s/3m0s

running (1m11.0s), 10/10 VUs, 131 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m10.9s/3m0s

running (1m12.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  1m11.9s/3m0s

running (1m13.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  1m12.9s/3m0s

running (1m14.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  1m13.9s/3m0s

running (1m15.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  1m14.9s/3m0s

running (1m16.0s), 10/10 VUs, 141 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  1m15.9s/3m0s

running (1m17.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  1m16.9s/3m0s

running (1m18.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  1m17.9s/3m0s

running (1m19.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  1m18.9s/3m0s

running (1m20.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  1m19.9s/3m0s

running (1m21.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  1m20.9s/3m0s

running (1m22.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  1m21.9s/3m0s

running (1m23.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  1m22.9s/3m0s

running (1m24.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  1m23.9s/3m0s

running (1m25.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  1m24.9s/3m0s

running (1m26.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  1m25.9s/3m0s

running (1m27.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  1m26.9s/3m0s

running (1m28.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  1m27.9s/3m0s

running (1m29.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  1m28.9s/3m0s

running (1m30.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  1m29.9s/3m0s

running (1m31.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  1m30.9s/3m0s

running (1m32.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  1m31.9s/3m0s

running (1m33.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  1m32.9s/3m0s

running (1m34.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  1m33.9s/3m0s

running (1m35.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  1m34.9s/3m0s

running (1m36.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  1m35.9s/3m0s

running (1m37.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  1m36.9s/3m0s

running (1m38.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  1m37.9s/3m0s

running (1m39.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  1m38.9s/3m0s

running (1m40.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  1m39.9s/3m0s

running (1m41.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  1m40.9s/3m0s

running (1m42.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  1m41.9s/3m0s

running (1m43.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  1m42.9s/3m0s

running (1m44.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  1m43.9s/3m0s

running (1m45.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  1m44.9s/3m0s

running (1m46.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  1m45.9s/3m0s

running (1m47.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  1m46.9s/3m0s

running (1m48.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  1m47.9s/3m0s

running (1m49.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  1m48.9s/3m0s

running (1m50.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  1m49.9s/3m0s

running (1m51.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  1m50.9s/3m0s

running (1m52.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  1m51.9s/3m0s

running (1m53.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  1m52.9s/3m0s

running (1m54.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  1m53.9s/3m0s

running (1m55.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  1m54.9s/3m0s

running (1m56.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  1m55.9s/3m0s

running (1m57.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  1m56.9s/3m0s

running (1m58.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  1m57.9s/3m0s

running (1m59.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  1m58.9s/3m0s

running (2m00.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  1m59.9s/3m0s

running (2m01.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  2m00.9s/3m0s

running (2m02.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  2m01.9s/3m0s

running (2m03.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  2m02.9s/3m0s

running (2m04.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  2m03.9s/3m0s

running (2m05.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  2m04.9s/3m0s

running (2m06.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  2m05.9s/3m0s

running (2m07.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  2m06.9s/3m0s

running (2m08.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  2m07.9s/3m0s

running (2m09.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  2m08.9s/3m0s

running (2m10.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  2m09.9s/3m0s

running (2m11.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  2m10.9s/3m0s

running (2m12.0s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  2m11.9s/3m0s

running (2m13.0s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  2m12.9s/3m0s

running (2m14.0s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  2m13.9s/3m0s

running (2m15.0s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  2m14.9s/3m0s

running (2m16.0s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  2m15.9s/3m0s

running (2m17.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  2m16.9s/3m0s

running (2m18.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  2m17.9s/3m0s

running (2m19.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  2m18.9s/3m0s

running (2m20.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  2m19.9s/3m0s

running (2m21.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  2m20.9s/3m0s

running (2m22.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  2m21.9s/3m0s

running (2m23.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  2m22.9s/3m0s

running (2m24.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  2m23.9s/3m0s

running (2m25.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  2m24.9s/3m0s

running (2m26.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  2m25.9s/3m0s

running (2m27.0s), 10/10 VUs, 281 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  2m26.9s/3m0s

running (2m28.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  2m27.9s/3m0s

running (2m29.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  2m28.9s/3m0s

running (2m30.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  2m29.9s/3m0s

running (2m31.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  2m30.9s/3m0s

running (2m32.0s), 10/10 VUs, 291 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  2m31.9s/3m0s

running (2m33.0s), 10/10 VUs, 300 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  2m32.9s/3m0s

running (2m34.0s), 10/10 VUs, 300 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  2m33.9s/3m0s

running (2m35.0s), 10/10 VUs, 300 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  2m34.9s/3m0s

running (2m36.0s), 10/10 VUs, 300 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  2m35.9s/3m0s

running (2m37.0s), 10/10 VUs, 301 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  2m36.9s/3m0s

running (2m38.0s), 10/10 VUs, 310 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  2m37.9s/3m0s

running (2m39.0s), 10/10 VUs, 310 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  2m38.9s/3m0s

running (2m40.0s), 10/10 VUs, 310 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  2m39.9s/3m0s

running (2m41.0s), 10/10 VUs, 310 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  2m40.9s/3m0s

running (2m42.0s), 10/10 VUs, 311 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  2m41.9s/3m0s

running (2m43.0s), 10/10 VUs, 320 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  2m42.9s/3m0s

running (2m44.0s), 10/10 VUs, 320 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  2m43.9s/3m0s

running (2m45.0s), 10/10 VUs, 320 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  2m44.9s/3m0s

running (2m46.0s), 10/10 VUs, 320 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  2m45.9s/3m0s

running (2m47.0s), 10/10 VUs, 321 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  2m46.9s/3m0s

running (2m48.0s), 10/10 VUs, 330 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  2m47.9s/3m0s

running (2m49.0s), 10/10 VUs, 330 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  2m48.9s/3m0s

running (2m50.0s), 10/10 VUs, 330 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  2m49.9s/3m0s

running (2m51.0s), 10/10 VUs, 330 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  2m50.9s/3m0s

running (2m52.0s), 10/10 VUs, 330 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  2m51.9s/3m0s

running (2m53.0s), 10/10 VUs, 340 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  2m52.9s/3m0s

running (2m54.0s), 10/10 VUs, 340 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  2m53.9s/3m0s

running (2m55.0s), 10/10 VUs, 340 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  2m54.9s/3m0s

running (2m56.0s), 10/10 VUs, 340 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  2m55.9s/3m0s

running (2m57.0s), 10/10 VUs, 340 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  2m56.9s/3m0s

running (2m58.0s), 10/10 VUs, 350 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  2m57.9s/3m0s

running (2m59.0s), 10/10 VUs, 350 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  2m58.9s/3m0s

running (3m00.0s), 10/10 VUs, 350 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  2m59.9s/3m0s

running (3m01.0s), 10/10 VUs, 350 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  3m0s

running (3m02.0s), 10/10 VUs, 350 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  3m0s


  █ THRESHOLDS 

    failed_requests
    ✓ 'rate<0.05' rate=0.00%

    http_req_duration
    ✓ 'p(95)<5000' p(95)=18.05ms

    paginated_query_duration
    ✓ 'p(95)<5000' p(95)=17.24ms


  █ TOTAL RESULTS 

    checks_total.......: 2160    11.829288/s
    checks_succeeded...: 100.00% 2160 out of 2160
    checks_failed......: 0.00%   0 out of 2160

    ✓ paginated p.0 → 200
    ✓ paginated p.10 → 200
    ✓ filter ACTIVO → 200
    ✓ filter FINALIZED → 200
    ✓ loan/user paginated → 200
    ✓ GET /kardex/paginated → 200

    CUSTOM
    failed_requests................: 0.00%  0 out of 2160
    filter_query_duration..........: avg=11.03ms min=2.24ms med=10.34ms max=23.29ms p(90)=17.33ms p(95)=19.06ms
    kardex_query_duration..........: avg=10.81ms min=3.42ms med=10.39ms max=21.73ms p(90)=15.79ms p(95)=17.28ms
    paginated_query_duration.......: avg=9.63ms  min=2.08ms med=8.96ms  max=33.35ms p(90)=14.79ms p(95)=17.24ms
    user_loans_query_duration......: avg=10.72ms min=3.31ms med=10.12ms max=23.47ms p(90)=15.72ms p(95)=16.56ms

    HTTP
    http_req_duration..............: avg=10.49ms min=2.08ms med=9.88ms  max=43.86ms p(90)=15.96ms p(95)=18.05ms
      { expected_response:true }...: avg=10.49ms min=2.08ms med=9.88ms  max=43.86ms p(90)=15.96ms p(95)=18.05ms
    http_req_failed................: 0.00%  0 out of 2161
    http_reqs......................: 2161   11.834764/s

    EXECUTION
    iteration_duration.............: avg=5.06s   min=5.03s  med=5.06s   max=5.11s   p(90)=5.08s   p(95)=5.09s  
    iterations.....................: 360    1.971548/s
    vus............................: 10     min=10        max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 9.0 MB 49 kB/s
    data_sent......................: 160 kB 876 B/s



running (3m02.6s), 00/10 VUs, 360 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  3m0s